owhinata/stm32f746g-disco/port/guix/guix_display.c
	ltdc_lock_frame();
	hdma2d_gui.Instance          = DMA2D;
	hdma2d_gui.Init.Mode         = DMA2D_M2M_BLEND;
	hdma2d_gui.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
	hdma2d_gui.Init.OutputOffset = dst_off;
	/* Foreground = source. */
	hdma2d_gui.LayerCfg[1].AlphaMode      = fg_amode;
	hdma2d_gui.LayerCfg[1].InputAlpha     = fg_alpha;
	hdma2d_gui.LayerCfg[1].InputColorMode = fg_cmode;
	hdma2d_gui.LayerCfg[1].InputOffset    = src_off;
	/* Background = destination (read-modify-write), same offset as output. */
	hdma2d_gui.LayerCfg[0].AlphaMode      = DMA2D_NO_MODIF_ALPHA;
	hdma2d_gui.LayerCfg[0].InputAlpha     = 0xFFu;
	hdma2d_gui.LayerCfg[0].InputColorMode = DMA2D_INPUT_RGB565;
	hdma2d_gui.LayerCfg[0].InputOffset    = dst_off;
	if (HAL_DMA2D_Init(&hdma2d_gui) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d_gui, 0) == HAL_OK &&
	    HAL_DMA2D_ConfigLayer(&hdma2d_gui, 1) == HAL_OK &&
	    HAL_DMA2D_BlendingStart(&hdma2d_gui, (uint32_t)(uintptr_t)src,
	                            (uint32_t)(uintptr_t)dst,
	                            (uint32_t)(uintptr_t)dst, w, h) == HAL_OK)
		HAL_DMA2D_PollForTransfer(&hdma2d_gui, 30);
	ltdc_unlock_frame();
}

void guix_display_fill_back(uint16_t rgb565)
{
	uint16_t *back = ltdc_back_buffer();

	if (back != NULL)
		guix_dma2d_fill(back, rgb565, LTDC_LCD_WIDTH, LTDC_LCD_HEIGHT, 0u);
}

int guix_display_copy_rgb565(uint16_t *dst, const uint16_t *src, uint32_t w,
                             uint32_t h, uint32_t dst_off, uint32_t src_off)
{
	return guix_dma2d_blit(dst, src, w, h, dst_off, src_off);
}

/*
 * DMA2D-accelerated horizontal line / solid fill.  GUIX fills widget rectangles
 * by calling this once per scanline-band; @p width is the band height.  The
 * software driver pre-clips, so the inputs are already inside the canvas -- we
 * mirror its contract exactly and only swap the inner pixel loop for a DMA2D R2M
 * rectangle fill.  A partially transparent brush (alpha != 0xff) falls back to
 * the saved software routine, which does the per-pixel blend.
 */
static VOID guix_horizontal_line_draw(GX_DRAW_CONTEXT *context, INT xstart,
                                      INT xend, INT ypos, INT width,
                                      GX_COLOR color)
{
	INT len   = xend - xstart + 1;
	INT pitch = context->gx_draw_context_pitch;   /* pixels per row */
	uint16_t *dst;

#if defined(GX_BRUSH_ALPHA_SUPPORT)
	GX_UBYTE alpha = context->gx_draw_context_brush.gx_brush_alpha;

	if (alpha == 0)
		return;                                /* fully transparent: nothing */
	if (alpha != 0xffu) {
		sw_horizontal_line_draw(context, xstart, xend, ypos, width, color);
		return;                                /* per-pixel blend in software */
	}
#endif
	if (len <= 0 || width <= 0)
		return;

	dst = (uint16_t *)context->gx_draw_context_memory +
	      (uint32_t)ypos * (uint32_t)pitch + (uint32_t)xstart;
	guix_dma2d_fill(dst, (uint16_t)color, (uint32_t)len, (uint32_t)width,
	                (uint32_t)(pitch - len));
}

/* ===== #59 Lever B2: camera live-preview copy-forward elimination ===========
 *
 * The camera icon (CAM_VIEW_W x CAM_VIEW_H at CAM_VIEW_X,CAM_VIEW_Y) is fully
 * repainted from cam_view_buf every preview frame, so forwarding it in the
 * buffer toggle is wasted SDRAM bandwidth (one ~150 KB DMA2D blit per displayed
 * frame) and a contributor to the DCMI DMA FIFO errors of #59.  We skip that
 * copy but must never present a STALE camera rect (a later non-camera flip could
 * otherwise show an older frame -> visible regression).  Correctness is enforced
 * at PRESENT time by a per-buffer freshness flag:
 *
 *   cam_buf_stale[i] == false   <=>   ltdc_fb[i]'s camera rect already holds the
 *                                     latest cam_view_buf content.
 *
 *   - a new view frame (guix_display_cam_view_store) makes BOTH buffers stale;
 *   - a full-rect camera pixelmap draw clears the drawn (back) buffer;
 *   - before each flip, if the buffer about to be presented is still stale we do
 *     a corrective view->buffer copy first.
 *
 * Every stale-flag transition is kept in the SAME ltdc_lock section as the DMA2D
 * copy it reflects, so the producer thread cannot advance cam_view_buf between a
 * copy and its flag update (a false-negative would present stale pixels). */
#define CAM_RECT_L  (CAM_VIEW_X)
#define CAM_RECT_T  (CAM_VIEW_Y)
#define CAM_RECT_R  (CAM_VIEW_X + CAM_VIEW_W - 1)
#define CAM_RECT_B  (CAM_VIEW_Y + CAM_VIEW_H - 1)

static bool      cam_preview_active;   /* session armed (begin..end): store() ok  */
static bool      cam_visible;          /* camera screen on display (SHOW..HIDE):
                                          gates the toggle's corrective + skip so
                                          we never stamp camera pixels onto, or
                                          drop a forward-copy on, another screen  */
static uint16_t *cam_view_data;        /* cam_view_buf base (registered by begin) */
static bool      cam_buf_stale[2];     /* per LTDC buffer; invariant above        */

/* True if screen-space rect r lies fully inside the camera icon rect. */
static bool rect_in_cam(const GX_RECTANGLE *r)
{
	return r->gx_rectangle_left   >= (GX_VALUE)CAM_RECT_L &&
	       r->gx_rectangle_top    >= (GX_VALUE)CAM_RECT_T &&
	       r->gx_rectangle_right  <= (GX_VALUE)CAM_RECT_R &&
	       r->gx_rectangle_bottom <= (GX_VALUE)CAM_RECT_B;
}

/* True if screen-space clip rect r fully COVERS the camera icon rect. */
static bool rect_covers_cam(const GX_RECTANGLE *r)
{
	return r->gx_rectangle_left   <= (GX_VALUE)CAM_RECT_L &&
	       r->gx_rectangle_top    <= (GX_VALUE)CAM_RECT_T &&
	       r->gx_rectangle_right  >= (GX_VALUE)CAM_RECT_R &&
	       r->gx_rectangle_bottom >= (GX_VALUE)CAM_RECT_B;
}

/* Corrective copy of the full camera rect (cam_view_buf -> @p fb at the icon
   position).  Caller holds ltdc_lock.  Tries DMA2D first and, on the rare DMA2D
   failure, falls back to a row-by-row CPU copy so the presented camera rect is
   ALWAYS made current -- the toggle therefore never has to skip the flip (which
   would strand that cycle's non-camera draws).  Both buffers are MPU
   non-cacheable SDRAM, so the CPU copy is coherent with no cache maintenance.
   Returns 0 when the rect was refreshed, -1 only on a NULL buffer (cannot happen
   while cam_visible, since begin() set cam_view_data). */
static int cam_rect_refresh(uint16_t *fb)
{
	uint16_t *dst;
	const uint16_t *src;
	uint32_t y;

	if (fb == NULL || cam_view_data == NULL)
		return -1;
	dst = fb + (uint32_t)CAM_RECT_T * LTDC_LCD_WIDTH + CAM_RECT_L;
	if (guix_dma2d_blit(dst, cam_view_data, CAM_VIEW_W, CAM_VIEW_H,
	                    LTDC_LCD_WIDTH - CAM_VIEW_W, 0u) == 0)
		return 0;
	/* DMA2D failed.  guix_dma2d_blit aborts a timed-out transfer, so the engine
	   is normally idle now; only run the CPU copy once that is confirmed (START
	   clear).  If the abort itself failed the engine is wedged (hard DMA2D
	   fault) -- do NOT race it with a CPU write; report failure and leave the
	   buffer stale. */
	if ((DMA2D->CR & DMA2D_CR_START) != 0u)
		return -1;
	src = cam_view_data;
	for (y = 0; y < CAM_VIEW_H; y++) {
		memcpy(dst, src, (size_t)CAM_VIEW_W * sizeof(uint16_t));
		dst += LTDC_LCD_WIDTH;
		src += CAM_VIEW_W;
	}
	return 0;
}

/* Register the view buffer and arm B2 for a preview session.  Both LTDC buffers
   start stale so the first frames are corrected before present. */
void guix_display_cam_preview_begin(uint16_t *view_buf)
{
	ltdc_lock_frame();
	cam_view_data      = view_buf;
	cam_buf_stale[0]   = true;
	cam_buf_stale[1]   = true;
	cam_preview_active = true;
	ltdc_unlock_frame();
}

