owhinata/stm32f746g-disco/port/guix/guix_display.c
void guix_display_cam_preview_end(void)
{
	ltdc_lock_frame();
	cam_preview_active = false;
	cam_visible        = false;
	cam_view_data      = NULL;
	ltdc_unlock_frame();
}

/* Gate the buffer-toggle B2 paths to when the camera screen is actually on
   display (set by the SHOW/HIDE root events on the GUIX thread).  Turning it on
   marks both buffers stale so the first presented frame is corrected -- the
   camera rect currently holds whatever the previous screen drew there. */
void guix_display_cam_set_visible(bool on)
{
	ltdc_lock_frame();
	cam_visible = on;
	if (on) {
		cam_buf_stale[0] = true;
		cam_buf_stale[1] = true;
	}
	ltdc_unlock_frame();
}

/* Store a freshly captured frame into the view buffer and mark BOTH LTDC buffers
   stale, atomically under ltdc_lock (#59 B2).  Returns 0 on a completed DMA2D
   copy, -1 otherwise. */
int guix_display_cam_view_store(const uint16_t *src)
{
	int rc;

	ltdc_lock_frame();
	if (cam_view_data == NULL || !cam_preview_active) {
		ltdc_unlock_frame();
		return -1;
	}
	rc = guix_dma2d_blit(cam_view_data, src, CAM_VIEW_W, CAM_VIEW_H, 0u, 0u);
	if (rc == 0) {
		cam_buf_stale[0] = true;
		cam_buf_stale[1] = true;
	}
	ltdc_unlock_frame();
	return rc;
}

/*
 * Tear-free buffer toggle (GUIX calls this once per refreshed frame).  GUIX has
 * just composited the accumulated dirty region into the back buffer (= the
 * canvas memory).  Present it, repoint the canvas at the new back buffer, and
 * copy the dirty rectangle forward from the just-presented front into the new
 * back so BOTH buffers stay identical -- next frame GUIX again only redraws the
 * changed region on top of correct prior content.  Both buffers start cleared to
 * black (ltdc_init), so the "identical everywhere outside the running dirty
 * set" invariant holds from the first frame.
 */
static VOID guix_buffer_toggle(GX_CANVAS *canvas, GX_RECTANGLE *dirty)
{
	uint16_t *front, *back;
	INT x, y, right, bottom, w, h;

	ltdc_lock_frame();

	/* The canvas must be on the current back buffer; if not, ownership was
	   broken (should never happen behind ltdc_gui_take).  Be defensive: skip. */
	if ((uint16_t *)canvas->gx_canvas_memory != ltdc_back_buffer()) {
		LOG_WRN("buffer toggle: canvas not on back buffer, skipping flip");
		ltdc_unlock_frame();
		return;
	}

	/* #59 B2: ensure the buffer about to be presented holds the latest camera
	   frame BEFORE the flip.  In steady-state preview the full-rect pixelmap
	   draw already cleared this buffer's stale flag, so the corrective copy only
	   fires on a non-camera cycle whose camera rect has fallen behind. */
	if (cam_visible) {
		uint8_t cur = (uint8_t)!ltdc_active_buffer();

		/* Make the buffer about to be presented hold the latest camera frame.
		   cam_rect_refresh falls back to a CPU copy if DMA2D fails, so it
		   succeeds whenever the view buffer is valid; clear stale only then.  We
		   never skip the flip here -- doing so would strand this cycle's
		   non-camera draws in the back buffer, and the normal copy-forward below
		   keeps the two buffers consistent outside the camera rect (#59). */
		if (cam_buf_stale[cur] &&
		    cam_rect_refresh((uint16_t *)canvas->gx_canvas_memory) == 0)
			cam_buf_stale[cur] = false;
	}

	if (ltdc_gui_flip() != LTDC_OK || !ltdc_is_up()) {
		ltdc_unlock_frame();
		return;                       /* display faulted: leave it be */
	}

	/* Repoint the canvas at the freshly-freed back buffer. */
	back  = ltdc_back_buffer();
	front = ltdc_framebuffer();       /* what we just presented */
	canvas->gx_canvas_memory = (GX_COLOR *)back;

	/* #59 B2: when the live preview is on and the whole dirty region is the
	   camera icon, skip the copy-forward -- that rect is repainted from
	   cam_view_buf every frame and its two-buffer consistency is maintained by
	   the stale tracking above, so forwarding it is wasted bandwidth. */
	if (cam_visible && rect_in_cam(dirty)) {
		ltdc_unlock_frame();
		return;
	}

	/* Copy the dirty rectangle forward (front -> new back), clipped to panel. */
	x      = dirty->gx_rectangle_left;
	y      = dirty->gx_rectangle_top;
	right  = dirty->gx_rectangle_right;
	bottom = dirty->gx_rectangle_bottom;
	if (x < 0)
		x = 0;
	if (y < 0)
		y = 0;
	if (right > (INT)LTDC_LCD_WIDTH - 1)
		right = (INT)LTDC_LCD_WIDTH - 1;
	if (bottom > (INT)LTDC_LCD_HEIGHT - 1)
		bottom = (INT)LTDC_LCD_HEIGHT - 1;
	w = right - x + 1;
	h = bottom - y + 1;
	if (w > 0 && h > 0 && front != NULL && back != NULL) {
		uint32_t off = (uint32_t)y * LTDC_LCD_WIDTH + (uint32_t)x;

		guix_dma2d_blit(back + off, front + off, (uint32_t)w, (uint32_t)h,
		                LTDC_LCD_WIDTH - (uint32_t)w,
		                LTDC_LCD_WIDTH - (uint32_t)w);
	}

	ltdc_unlock_frame();
}

/*
 * DMA2D pixelmap draw (uncompressed, opaque RGB565 only).  GUIX pre-clips, so the
 * clip rectangle bounds the on-screen region; the source starts at the matching
 * offset inside the pixelmap.  Everything else (compressed, alpha-plane,
 * transparent, palette, ARGB formats, partial brush alpha, cacheable-SRAM
 * source) defers to the software 565rgb driver.  This is the path #56 uses to
 * blit camera frames (RGB565 in SDRAM). RM0385 §9.3.3 (M2M).
 */
static VOID guix_pixelmap_draw(GX_DRAW_CONTEXT *context, INT xpos, INT ypos,
                               GX_PIXELMAP *pmp)
{
	GX_RECTANGLE *clip = context->gx_draw_context_clip;
	INT pitch = context->gx_draw_context_pitch;
	INT w, h;

#if defined(GX_BRUSH_ALPHA_SUPPORT)
	if (context->gx_draw_context_brush.gx_brush_alpha != 0xffu) {
		sw_pixelmap_draw(context, xpos, ypos, pmp);
		return;
	}
#endif
	if (pmp->gx_pixelmap_format != GX_COLOR_FORMAT_565RGB ||
	    (pmp->gx_pixelmap_flags & (GX_PIXELMAP_COMPRESSED | GX_PIXELMAP_ALPHA |
	                               GX_PIXELMAP_TRANSPARENT)) ||
	    !guix_dma2d_src_ok(pmp->gx_pixelmap_data)) {
		sw_pixelmap_draw(context, xpos, ypos, pmp);
		return;
	}
	w = clip->gx_rectangle_right - clip->gx_rectangle_left + 1;
	h = clip->gx_rectangle_bottom - clip->gx_rectangle_top + 1;
	if (w <= 0 || h <= 0)
		return;
	{
		uint16_t *dst = (uint16_t *)context->gx_draw_context_memory +
		                (uint32_t)clip->gx_rectangle_top * (uint32_t)pitch +
		                (uint32_t)clip->gx_rectangle_left;
		const uint16_t *src = (const uint16_t *)pmp->gx_pixelmap_data +
		                (uint32_t)(clip->gx_rectangle_top - ypos) *
		                    (uint32_t)pmp->gx_pixelmap_width +
		                (uint32_t)(clip->gx_rectangle_left - xpos);
		uint32_t dst_off = (uint32_t)(pitch - w);
		uint32_t src_off = (uint32_t)(pmp->gx_pixelmap_width - w);

		/* #59 B2: the camera live-preview icon draws cam_view_buf into the back
		   buffer.  Keep the blit and the stale-flag clear in one ltdc_lock
		   section so the producer cannot advance cam_view_buf in between (a
		   false-negative would later present stale pixels).  Only a clip that
		   fully covers the icon rect counts as a complete repaint. */
		if (cam_preview_active &&
		    (uint16_t *)pmp->gx_pixelmap_data == cam_view_data) {
			ltdc_lock_frame();
			/* Clear the stale flag only when the copy actually COMPLETED and it
			   covered the whole icon rect -- otherwise the buffer's camera rect
			   is not really the latest view and must stay stale (#59). */
			if (guix_dma2d_blit(dst, src, (uint32_t)w, (uint32_t)h,
			                    dst_off, src_off) == 0 && rect_covers_cam(clip))
				cam_buf_stale[!ltdc_active_buffer()] = false;
			ltdc_unlock_frame();
		} else {
			(void)guix_dma2d_blit(dst, src, (uint32_t)w, (uint32_t)h,
			                      dst_off, src_off);
		}
	}
}

